routes/web.php


require __DIR__.'/auth.php';

Route::get('cache',function(){
    $value = Cache::remember('videos_count',10,function(){
        sleep(3);
        return Video::all()->count();
    });

    dump($value);
});
---
select * from `videos`