app/View/Components/RelatedVideos.php

select * from `videos` where `videos`.`id` = '128' limit 1
select * from `categories` where `categories`.`id` in (6)
select * from `users` where `users`.`id` in (4, 5, 7, 9, 11)
---
    public function __construct($video)
    {
        $video = Video::query()->findOrFail($video);
        $this->videos = $video->relatedVideos()->load(['user','category']);