app/Http/Controllers/CategoryVideoController.php

    public function index(Category $category)
    {
        $videos = $category->videos()->paginate();
---
select * from `videos` where `videos`.`category_id` = 5 and `videos`.`category_id` is not null limit 18 offset 0
select count(*) as aggregate from `videos` where `videos`.`category_id` = 5 and `videos`.`category_id` is not null