app/Http/Controllers/CommentController.php

insert into `comments` (`user_id`, `body`, `video_id`, `updated_at`, `created_at`) values (13, 'عالی بود', 14, '2024-01-17 16:11:45', '2024-01-17 16:11:45')
---
    public function store(StoreRequest $request,Video $video)
    {
        // $this->authorize('create',[Comment::class,$video]);
        try {

            $createdComment = $video->comments()->create([
                'user_id' => auth()->id(),
                'body' => $request->body,
            ]);