app/Http/Controllers/IndexController.php

    public function index()
    {
        $latestVideos = Video::with(['user','category'])->latest()->take(6)->get();
        $mostPopularVideos = Video::with(['user','category'])->get()->random(6);
        $mostViewedVideos = Video::with(['user','category'])->get()->random(6);
---
select * from `categories` where `categories`.`id` in (2, 3, 4, 5)
select * from `users` where `users`.`id` in (4, 8, 9, 10, 11, 12)
select * from `videos` order by `created_at` desc limit 6
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6, 7)
select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12)
select * from `videos`