app/Http/Controllers/VideoController.php

    public function show(Video $video)
    {
        $video->load('comments.user');
        $relatedVideos = Video::all()->random(8);
---
select * from `comments` where `comments`.`video_id` in (14) order by `created_at` desc
select * from `users` where `users`.`id` in (1, 2, 3, 5)
select * from `videos`