app/Models/Category.php

select * from `videos` where `videos`.`category_id` = 5 and `videos`.`category_id` is not null order by RAND()
---
    public function getRandomVideos(int $count,int $id = null)
    {
        return $this->videos()->inRandomOrder()->get()->take($count)->except($id);